[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=24
width=416
height=416
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1

learning_rate=0.00261
burn_in=1000
max_batches=2000
policy=steps
steps=1600.0,1800.0
scales=.1,.1

#layer 0
[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

#layer 1
[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=leaky

#layer 2
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

#layer 3
[route]
layers=-1
groups=2
group_id=1

#layer 4
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

#layer 5
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

#layer 6
[route]
layers = -1,-2

#layer 7
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=leaky

#layer 8
[route]
layers = -6,-1

#layer 9
[maxpool]
size=2
stride=2

#layer 10
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

#layer 11
[route]
layers=-1
groups=2
group_id=1

#layer 12
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

#layer 13
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=leaky

#layer 14
[route]
layers = -1,-2

#layer 15
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#layer 16
[route]
layers = -6,-1

#layer 17
[maxpool]
size=2
stride=2

#layer 18
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

#layer 19
[route]
layers=-1
groups=2
group_id=1

#layer 20
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

#layer 21
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=leaky

#layer 22
[route]
layers = -1,-2

#layer 23
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 24
[route]
layers = -6,-1

#layer 25
[maxpool]
size=2
stride=2

#layer 26
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

##################################

#layer 27
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 28
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=leaky

#layer 29
[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

#layer 30
[yolo]
mask = 3,4,5
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=0
nms_kind=greedynms
beta_nms=0.6

#layer 31
[route]
layers = -4

#layer 32
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#layer 33
[upsample]
stride=2

#layer 34
[route]
layers = -1, 23

#layer 35
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=leaky

#layer 36
[convolutional]
size=1
stride=1
pad=1
filters=18
activation=linear

#layer 37
[yolo]
mask = 1,2,3
anchors = 10,14,  23,27,  37,58,  81,82,  135,169,  344,319
classes=1
num=6
jitter=.3
scale_x_y = 1.05
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
ignore_thresh = .7
truth_thresh = 1
random=0
nms_kind=greedynms
beta_nms=0.6
