[net]
# Testing
#batch=1
#subdivisions=1
# Training
batch=64
subdivisions=16
width=608
height=608
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1

learning_rate=0.001
burn_in=1000
max_batches=2000
policy=steps
steps=1600.0,1800.0
scales=.1,.1

#cutmix=1
mosaic=1

#:104x104 54:52x52 85:26x26 104:13x13 for 416

#layer 0
[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=mish

# Downsample
#layer 1
[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=mish

#layer 2
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 3
[route]
layers = -2

#layer 4
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 5
[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=mish

#layer 6
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

#layer 7
[shortcut]
from=-3
activation=linear

#layer 8
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 9
[route]
layers = -1,-7

#layer 10
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

# Downsample
#layer 11
[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=mish

#layer 12
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 13
[route]
layers = -2

#layer 14
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 15
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 16
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

#layer 17
[shortcut]
from=-3
activation=linear

#layer 18
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 19
[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=mish

#layer 20
[shortcut]
from=-3
activation=linear

#layer 21
[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=mish

#layer 22
[route]
layers = -1,-10

#layer 23
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

# Downsample
#layer 24
[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=mish

#layer 25
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 26
[route]
layers = -2

#layer 27
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 28
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 29
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 30
[shortcut]
from=-3
activation=linear

#layer 31
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 32
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 33
[shortcut]
from=-3
activation=linear

#layer 34
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 35
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 36
[shortcut]
from=-3
activation=linear

#layer 37
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 38
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 39
[shortcut]
from=-3
activation=linear

#layer 40
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 41
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 42
[shortcut]
from=-3
activation=linear

#layer 43
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 44
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 45
[shortcut]
from=-3
activation=linear

#layer 46
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 47
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 48
[shortcut]
from=-3
activation=linear

#layer 49
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 50
[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=mish

#layer 51
[shortcut]
from=-3
activation=linear

#layer 52
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=mish

#layer 53
[route]
layers = -1,-28

#layer 54
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

# Downsample
#layer 55
[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=mish

#layer 56
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 57
[route]
layers = -2

#layer 58
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 59
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 60
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 61
[shortcut]
from=-3
activation=linear

#layer 62
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 63
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 64
[shortcut]
from=-3
activation=linear

#layer 65
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 66
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 67
[shortcut]
from=-3
activation=linear

#layer 68
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 69
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 70
[shortcut]
from=-3
activation=linear

#layer 71
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 72
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 73
[shortcut]
from=-3
activation=linear

#layer 74
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 75
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 76
[shortcut]
from=-3
activation=linear

#layer 77
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 78
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 79
[shortcut]
from=-3
activation=linear

#layer 80
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 81
[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=mish

#layer 82
[shortcut]
from=-3
activation=linear

#layer 83
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=mish

#layer 84
[route]
layers = -1,-28

#layer 85
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

# Downsample
#layer 86
[convolutional]
batch_normalize=1
filters=1024
size=3
stride=2
pad=1
activation=mish

#layer 87
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

#layer 88
[route]
layers = -2

#layer 89
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

#layer 90
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

#layer 91
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

#layer 92
[shortcut]
from=-3
activation=linear

#layer 93
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

#layer 94
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

#layer 95
[shortcut]
from=-3
activation=linear

#layer 96
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

#layer 97
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

#layer 98
[shortcut]
from=-3
activation=linear

#layer 99
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

#layer 100
[convolutional]
batch_normalize=1
filters=512
size=3
stride=1
pad=1
activation=mish

#layer 101
[shortcut]
from=-3
activation=linear

#layer 102
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=mish

#layer 103
[route]
layers = -1,-16

#layer 104
[convolutional]
batch_normalize=1
filters=1024
size=1
stride=1
pad=1
activation=mish
stopbackward=800

##########################

#layer 105
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#layer 106
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

#layer 107
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

### SPP ###
#layer 108
[maxpool]
stride=1
size=5

#layer 109
[route]
layers=-2

#layer 110
[maxpool]
stride=1
size=9

#layer 111
[route]
layers=-4

#layer 112
[maxpool]
stride=1
size=13

#layer 113
[route]
layers=-1,-3,-5,-6
### End SPP ###

#layer 114
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#layer 115
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

#layer 116
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#layer 117
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 118
[upsample]
stride=2

#layer 119
[route]
layers = 85

#layer 120
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 121
[route]
layers = -1, -3

#layer 122
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 123
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

#layer 124
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 125
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

#layer 126
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 127
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#layer 128
[upsample]
stride=2

#layer 129
[route]
layers = 54

#layer 130
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#layer 131
[route]
layers = -1, -3

#layer 132
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#layer 133
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

#layer 134
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

#layer 135
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

#layer 136
[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=leaky

##########################

#layer 137
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=256
activation=leaky

#layer 138
[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

#layer 139
[yolo]
mask = 0,1,2
anchors = 12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=80
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
scale_x_y = 1.2
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

#layer 140
[route]
layers = -4

#layer 141
[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=256
activation=leaky

#layer 142
[route]
layers = -1, -16

#layer 143
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 144
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

#layer 145
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 146
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

#layer 147
[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=leaky

#layer 148
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=512
activation=leaky

#layer 149
[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

#layer 150
[yolo]
mask = 3,4,5
anchors = 12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=80
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
scale_x_y = 1.1
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

#layer 151
[route]
layers = -4

#layer 152
[convolutional]
batch_normalize=1
size=3
stride=2
pad=1
filters=512
activation=leaky

#layer 153
[route]
layers = -1, -37

#layer 154
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#layer 155
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

#layer 156
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#layer 157
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

#layer 158
[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=leaky

#layer 159
[convolutional]
batch_normalize=1
size=3
stride=1
pad=1
filters=1024
activation=leaky

#layer 160
[convolutional]
size=1
stride=1
pad=1
filters=255
activation=linear

#layer 161
[yolo]
mask = 6,7,8
anchors = 12, 16, 19, 36, 40, 28, 36, 75, 76, 55, 72, 146, 142, 110, 192, 243, 459, 401
classes=80
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
random=1
scale_x_y = 1.05
iou_thresh=0.213
cls_normalizer=1.0
iou_normalizer=0.07
iou_loss=ciou
nms_kind=greedynms
beta_nms=0.6
max_delta=5

